{
  "backend/main.mo": "Defines task, content, and user profile types and manages user data with admin bootstrap, role assignment, and permission‑checked queries.",
  "feature_evidence.json": "Lists feature evidence entries linking feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of many frontend files for documentation or planning.",
  "frontend/index.css": "Defines Tailwind base layers with light/dark theme variables using OKLCH color values.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes with auth‑gated pages and wraps the app in theme and layout providers.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "UI screen shown when admin access fails, including bootstrap admin action when enabled and principal copy utilities.",
  "frontend/src/components/dashboard/DailyContentCarousel.tsx": "Fetches and displays rotating daily content slides with loading, error, and empty states.",
  "frontend/src/components/dashboard/DailyOverviewTiles.tsx": "Displays daily activity tiles by fetching a task for a date and showing completion status and summaries for each activity.",
  "frontend/src/components/dashboard/DailyProgressBar.tsx": "Calculates and displays a progress bar showing how many of six daily activities are completed.",
  "frontend/src/components/dashboard/DateSelector.tsx": "Provides a popover date picker button allowing users to select a date.",
  "frontend/src/components/dashboard/MonthlyProgressChart.tsx": "Renders an SVG line chart showing daily percentage progress across a month.",
  "frontend/src/components/layout/AppFooter.tsx": "Shows a footer with attribution and a link to caffeine.ai including dynamic year and hostname.",
  "frontend/src/components/layout/AppHeader.tsx": "Displays the app header with theme toggle, user menu, navigation links, and logout options.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app layout with header, main content outlet, and footer.",
  "frontend/src/components/reports/DownloadCsvCard.tsx": "Provides UI to select a date range, fetch tasks, and download them as a CSV report.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Manages theme state (light, dark, system) and applies resolved theme to the document.",
  "frontend/src/components/tracking/FastingModule.tsx": "Allows users to record fasting status and notes for a selected date, syncing updates to the backend.",
  "frontend/src/components/tracking/MurojaahModule.tsx": "UI module for viewing and editing Murojaah tasks, including surah and verse range, with save functionality using backend mutations.",
  "frontend/src/components/tracking/SedekahModule.tsx": "Handles Sedekah task completion and triggers payment link flow, updating backend task status.",
  "frontend/src/components/tracking/SholatModule.tsx": "Provides toggle controls for daily prayer completion and updates the sholat task via backend mutations.",
  "frontend/src/components/tracking/TahfidzModule.tsx": "UI for updating Tahfidz memorization tasks with surah and verse range fields and saving via backend.",
  "frontend/src/components/tracking/TilawahModule.tsx": "Allows editing Tilawah reading tasks by surah and verse range and persists changes through backend.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Provides authentication state, role/admin queries, login/logout handling, and error retry logic.",
  "frontend/src/hooks/useBackendQueries.ts": "Collection of react-query wrappers for backend operations including user profile, roles, admin actions, and task CRUD.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for managing Internet Identity authentication using AuthClient, including login, logout, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/admin/AdminGatePage.tsx": "Handles admin access control, showing loading, error, denied, or admin panel states based on authentication and role checks.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Provides the admin dashboard with tabs for user management, content, statistics, and settings.",
  "frontend/src/pages/admin/DailyContentTab.tsx": "Admin UI for viewing and editing daily Quran reflection, hadith, and motivational content, with backend persistence and preview.",
  "frontend/src/pages/admin/SettingsTab.tsx": "Provides a form to view and update the global sedekah payment link with backend syncing.",
  "frontend/src/pages/admin/StatisticsTab.tsx": "Displays date‑range‑based user participation stats, currently showing user count and placeholder progress metrics.",
  "frontend/src/pages/admin/UserManagementTab.tsx": "Admin interface to list users and create new accounts using principal, name, and email via backend mutations.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the user dashboard with daily tracking modules, profile setup flow, date selection, progress, and data loading.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login screen that triggers authentication and redirects authenticated users to the home page.",
  "frontend/src/pages/MonthlyProgressPage.tsx": "Shows monthly task completion stats and charts by fetching tasks in a date range and allowing month navigation.",
  "frontend/src/utils/csv.ts": "Generates CSV exports from task data, formatting dates and escaping fields safely.",
  "frontend/src/utils/date.ts": "Provides helpers for converting between dates and Unix timestamps and formatting dates.",
  "frontend/src/utils/month.ts": "Utility functions for month boundaries, day counts, labels, and listing days in a month.",
  "frontend/src/utils/progress.ts": "Computes task completion percentage based on six criteria including full wajib prayer completion.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/validation.ts": "Validates surah verse ranges, ensuring required fields and correct numeric ordering.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended OKLCH-based color system, custom animations, and typography/container/animate plugins.",
  "project_state.json": "Defines the project’s state, features, issues, and architectural notes for the Ramadhan Tracker web app, including admin-only accounts, tracking modules, and known production problems."
}