{
  "backend/main.mo": "Defines user tasks, profiles, daily content, and admin role management with bootstrap admin flow and authorization checks.",
  "feature_evidence.json": "Lists feature evidence entries specifying related files, components, and test IDs for prayer time fixes and error handling.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files and components for reference.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme tokens and global styles.",
  "frontend/index.html": "HTML entry point loading the main React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, route guards, theme provider, and auth-aware routing logic including admin redirection.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "UI shown when a user lacks admin rights, offering bootstrap admin option and principal copy action.",
  "frontend/src/components/dashboard/DailyContentCarousel.tsx": "Carousel that auto-rotates through daily content with loading, empty, and error states.",
  "frontend/src/components/dashboard/DailyOverviewTiles.tsx": "Displays six daily task tiles using task data and completion status, with loading skeletons while fetching. Computes wajib and sunnah prayer counts and renders task summaries.",
  "frontend/src/components/dashboard/DailyProgressBar.tsx": "Shows a daily progress bar based on completed tasks and handles loading and empty states. Calculates completion percentage and displays item counts.",
  "frontend/src/components/dashboard/DateSelector.tsx": "Provides a popover date picker button using a calendar component. Allows selecting a date and emits changes to the parent.",
  "frontend/src/components/dashboard/MonthlyProgressChart.tsx": "Renders an interactive SVG line chart of daily percentages with tooltips for hover/touch. Calculates plot points and manages tooltip state.",
  "frontend/src/components/dashboard/PrayerTimesSection.tsx": "Displays prayer times for the selected date with timezone selection, loading skeletons, and error handling. Fetches times via usePrayerTimes and renders them in a grid.",
  "frontend/src/components/dashboard/YesterdayProgressSummary.tsx": "Shows yesterday’s tilawah, tahfidz, and murojaah summaries with loading skeletons. Fetches previous day's task data and formats verse ranges.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders the footer with current year, branding, and a referral link. Displays a heart icon and app identifier in the link.",
  "frontend/src/components/layout/AppHeader.tsx": "Displays the authenticated user header with theme toggle, profile menu, and navigation links including admin options. Uses auth and user profile hooks for state.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, footer, and routed content area. Wraps the page in a full-height flex container.",
  "frontend/src/components/reports/DownloadCsvCard.tsx": "Provides a UI card to select date ranges and export tasks as CSV or PDF by querying the backend and triggering a file download.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Implements a theme context with light, dark, and system modes, persisting user preference and applying it to the document root.",
  "frontend/src/components/tracking/FastingModule.tsx": "Displays and updates daily fasting status and notes by fetching and saving task data to the backend.",
  "frontend/src/components/tracking/MurojaahModule.tsx": "Lets users input and save Murojaah surah and verse ranges with validation, syncing changes to the backend.",
  "frontend/src/components/tracking/SedekahModule.tsx": "Shows sedekah status and triggers donation flow by recording completion and opening a configured payment link.",
  "frontend/src/components/tracking/SholatModule.tsx": "Provides toggle switches for each prayer time and saves updated prayer completion states to the backend.",
  "frontend/src/components/tracking/TahfidzModule.tsx": "Allows entering and saving Tahfidz surah and verse ranges with validation, updating the corresponding task data.",
  "frontend/src/components/tracking/TilawahModule.tsx": "UI component for viewing and editing daily tilawah data, loading existing task values and saving updates via backend mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Provides authentication state, user role/admin status queries, and login/logout utilities using Internet Identity.",
  "frontend/src/hooks/useBackendQueries.ts": "React Query wrappers for backend actor calls, including user profile, roles, admin actions, and daily task queries/mutations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for managing Internet Identity authentication, storing identity, and handling login states.",
  "frontend/src/hooks/usePrayerTimes.ts": "Computes and validates prayer times for a selected date with timezone persistence, error handling, and auto-refresh at midnight.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining a light/dark theme with Islamic-inspired color palette.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminGatePage.tsx": "Checks authentication and admin privileges before granting access to the admin panel, showing loading, error, or access-denied states as needed.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Hosts the admin panel with tabbed navigation for managing users, content, statistics, and app settings.",
  "frontend/src/pages/admin/DailyContentTab.tsx": "Allows admins to view, edit, and save daily Qur'an reflection, hadith, and motivational content, with preview and validation.",
  "frontend/src/pages/admin/SettingsTab.tsx": "Lets admins configure global app settings, primarily the sedekah payment link, with loading and save handling.",
  "frontend/src/pages/admin/StatisticsTab.tsx": "Renders admin statistics UI with date filters, total users, and placeholder participation metrics. Uses backend hooks to load users and show basic stats when triggered.",
  "frontend/src/pages/admin/UserManagementTab.tsx": "Provides UI for listing users and creating new accounts via dialog with validation and backend mutations. Supports principal entry, profile fields, and success/error toasts.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the main dashboard, loading the user profile, handling profile setup, and displaying daily tracking modules and content based on the selected date.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login screen that triggers authentication and redirects users to their intended destination or the dashboard.",
  "frontend/src/pages/MonthlyProgressPage.tsx": "Displays monthly progress analytics with charts and stats, fetching tasks for the selected month and allowing navigation between months.",
  "frontend/src/utils/csv.ts": "Generates a CSV string from task data, converting timestamps and formatting worship-related fields. Includes CSV escaping for safe output.",
  "frontend/src/utils/date.ts": "Provides timestamp/date conversion helpers and utilities for formatting and navigating dates. Includes functions for today’s timestamp and HTML date input formatting.",
  "frontend/src/utils/month.ts": "Utility functions for month calculations such as start/end dates, day counts, labels, and day arrays. Simplifies monthly calendar operations.",
  "frontend/src/utils/pdf.ts": "Builds a simple text-based PDF Blob summarizing tasks for a date range without external libraries. Formats worship data into a readable PDF structure.",
  "frontend/src/utils/prayerTimes.ts": "Calculates Indonesian prayer times using simplified astronomical formulas per timezone. Includes helper functions for solar position and angle-based prayer calculations.",
  "frontend/src/utils/progress.ts": "Computes completion percentage and item counts for tasks, treating five daily prayers as a single required unit. Supports progress display logic for daily tasks.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params, persist them in sessionStorage, and clear them from the hash for routing and token handling.",
  "frontend/src/utils/validation.ts": "Validates surah and verse range inputs, ensuring required fields and proper numeric ordering.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes project state, architecture notes, known issues, and existing features for the Ramadhan Tracker app."
}