{
  "backend/main.mo": "Main Motoko canister implementing user profiles, tasks, daily content storage, and admin‑protected user management with authorization mixin.",
  "backend/migration.mo": "Initializes daily content map on first run by inserting a default reflection, hadith, and motivation entry.",
  "feature_evidence.json": "Feature evidence report listing dashboard daily content improvements, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend files and components.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React app root that configures TanStack Router routes, auth guards, and the theme and layout shell.",
  "frontend/src/components/dashboard/DailyContentCarousel.tsx": "Carousel that displays daily Tadabbur, Hadith, and Islamic Quote content with loading, empty, and error states.",
  "frontend/src/components/dashboard/DailyOverviewTiles.tsx": "Displays five activity summary tiles for the selected date using task data from backend queries.",
  "frontend/src/components/dashboard/DailyProgressBar.tsx": "Computes and displays daily worship completion progress using a progress bar.",
  "frontend/src/components/dashboard/DateSelector.tsx": "A popover calendar button that displays and updates a selected date.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders the site footer with dynamic year and a referral link.",
  "frontend/src/components/layout/AppHeader.tsx": "Authenticated header with theme toggle, user menu, navigation, and logout.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing header, footer, and main routing outlet.",
  "frontend/src/components/reports/DownloadCsvCard.tsx": "Form for selecting date range and generating a CSV, currently producing a placeholder file.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Context provider managing persisted light/dark/system theme and resolution.",
  "frontend/src/components/tracking/FastingModule.tsx": "Displays and updates fasting status and notes for a selected date.",
  "frontend/src/components/tracking/MurojaahModule.tsx": "Allows input and validation of Murojaah surah and verse range, saving to backend.",
  "frontend/src/components/tracking/SedekahModule.tsx": "Handles Sedekah completion with payment link integration and status display.",
  "frontend/src/components/tracking/TahfidzModule.tsx": "Captures and saves Tahfidz surah and verse range with validation.",
  "frontend/src/components/tracking/TilawahModule.tsx": "UI module for entering and saving tilawah data by fetching an existing task and updating surah and verse range.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity login state and provides user role, admin status, and logout handling.",
  "frontend/src/hooks/useBackendQueries.ts": "React Query hooks for fetching and mutating user profiles, roles, tasks, and daily content via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and logic for loading, logging in, and clearing stored identities.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables with an Islamic-inspired color palette.",
  "frontend/src/main.tsx": "App entry point initializing React, InternetIdentityProvider, and React Query.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Renders the main admin panel with tab navigation for users, content, statistics, and settings.",
  "frontend/src/pages/admin/DailyContentTab.tsx": "Allows admins to view, edit, and save daily content including Quran reflections, hadith, and motivational quotes.",
  "frontend/src/pages/admin/SettingsTab.tsx": "Provides a form to view and update the Sedekah payment link with loading and save states.",
  "frontend/src/pages/admin/StatisticsTab.tsx": "Displays user statistics based on a selected date range and shows overall participation metrics.",
  "frontend/src/pages/admin/UserManagementTab.tsx": "Lists users and includes functionality to create new user accounts via a dialog form.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard showing user profile setup, date selection, daily content, progress, and tracking modules.",
  "frontend/src/pages/LoginPage.tsx": "Login page prompting users to authenticate via Internet Identity and redirecting if already logged in.",
  "frontend/src/utils/csv.ts": "Generates CSV output from task data, formatting fields and escaping values safely.",
  "frontend/src/utils/date.ts": "Contains helpers for converting between dates and timestamps and formatting dates.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/validation.ts": "Validates surah verse ranges, ensuring required fields and correct numeric ordering.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color palette, extended animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, features, architecture notes, known issues, and requirements for the Ramadhan Tracker app."
}