{
  "backend/main.mo": "Main backend actor managing user tasks, profiles, daily content, and authorization-protected CRUD operations.",
  "backend/migration.mo": "Migration module that passes through the actor state without changes.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind-based global CSS defining light/dark theme tokens and resets.",
  "frontend/index.html": "Base HTML document mounting the React app entry point.",
  "frontend/src/App.tsx": "Sets up routing, authentication guards, theming, and global app shell for the React application.",
  "frontend/src/components/dashboard/DailyContentCarousel.tsx": "Carousel component fetching and displaying daily content with loading, empty, and error states.",
  "frontend/src/components/dashboard/DailyOverviewTiles.tsx": "Displays daily task tiles using fetched task data, showing completion states and summaries for each activity.",
  "frontend/src/components/dashboard/DailyProgressBar.tsx": "Renders a progress bar calculating percentage completion of six daily activities based on task data.",
  "frontend/src/components/dashboard/DateSelector.tsx": "Provides a popover calendar button allowing users to pick a date and trigger updates.",
  "frontend/src/components/dashboard/MonthlyProgressChart.tsx": "Generates an SVG line chart of daily percentage progress with axes, labels, and scrollable width.",
  "frontend/src/components/layout/AppFooter.tsx": "Displays footer with copyright text, heart icon, and a caffeine.ai referral link.",
  "frontend/src/components/layout/AppHeader.tsx": "Shows authenticated header with theme toggle, user menu, navigation links, and logout option.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app with header, routed main content, and footer layout structure.",
  "frontend/src/components/reports/DownloadCsvCard.tsx": "Allows users to select a date range and download task data as a CSV via backend actor calls.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Manages theme state (light, dark, system) with localStorage and exposes theme context/hooks.",
  "frontend/src/components/tracking/FastingModule.tsx": "Lets users record fasting status and notes for a selected date, updating backend task data.",
  "frontend/src/components/tracking/MurojaahModule.tsx": "UI module for viewing and editing daily murojaah surah and verse range, saving updates via backend mutations.",
  "frontend/src/components/tracking/SedekahModule.tsx": "Displays sedekah status and triggers backend update plus opening a payment link for donations.",
  "frontend/src/components/tracking/SholatModule.tsx": "Manages toggle switches for daily prayer completion and saves state to backend on change.",
  "frontend/src/components/tracking/TahfidzModule.tsx": "UI for entering and saving tahfidz surah and verse range, validating input and updating backend.",
  "frontend/src/components/tracking/TilawahModule.tsx": "Handles tilawah surah and verse input fields and persists changes through backend updates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches authenticated or anonymous backend actors and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides authentication state, user role, admin status, and logout handling via Internet Identity.",
  "frontend/src/hooks/useBackendQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, tasks, and daily content through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state, login, and logout helpers. Wraps AuthClient creation and manages login status flags.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers and custom CSS variables for light and dark themes. Sets base typography, colors, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider. Loads global styles and renders the root App component.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Renders the admin panel with tabbed sections for users, content, statistics, and settings. Each tab loads its corresponding management component.",
  "frontend/src/pages/admin/DailyContentTab.tsx": "Allows admins to view, edit, and save daily content entries such as Quran reflections, hadith, and motivational quotes. Loads existing content, updates it, and provides a preview.",
  "frontend/src/pages/admin/SettingsTab.tsx": "Provides a form to view and update the global sedekah payment link, with loading and save states.",
  "frontend/src/pages/admin/StatisticsTab.tsx": "Shows user count and placeholder participation stats for a selected date range.",
  "frontend/src/pages/admin/UserManagementTab.tsx": "Lists all users and provides a dialog to create new users using principal, name, and email.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the user’s daily dashboard with modules for various worship activities and initializes user profile setup. Manages date selection, profile form, and loading states.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login screen using useAuth, redirecting authenticated users and showing a loading state during login. Includes a styled card with login instructions and button.",
  "frontend/src/pages/MonthlyProgressPage.tsx": "Shows monthly progress charts by fetching tasks in a date range and computing daily and aggregate completion stats. Allows navigating between months and handles loading/error states.",
  "frontend/src/utils/csv.ts": "Generates a CSV export of task data with headers and escaped values.",
  "frontend/src/utils/date.ts": "Provides timestamp conversion helpers and date formatting utilities.",
  "frontend/src/utils/month.ts": "Offers helpers for month boundaries, day lists, and Indonesian month labels.",
  "frontend/src/utils/progress.ts": "Computes overall task completion percentage based on six criteria.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/src/utils/validation.ts": "Validates that a surah and verse range are correctly specified.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and container settings.",
  "project_state.json": "Contains the full project state for a Ramadhan tracking web app, including feature descriptions, architecture notes, known issues, and existing implemented features. Serves as the authoritative specification for current behavior, bugs, and requirements."
}