{
  "backend/main.mo": "Defines user task types, daily content, profiles, and admin authorization logic with bootstrap admin creation and role management.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides concise summaries of numerous frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes with authentication guards and wraps the app in theming and layout providers.",
  "frontend/src/components/auth/AdminAccessDeniedScreen.tsx": "Admin access denial UI with bootstrap-admin flow, principal copy helper, and promote-to-admin mutation handling.",
  "frontend/src/components/dashboard/DailyContentCarousel.tsx": "Displays daily Islamic content in an auto-rotating carousel with loading, empty, and error states.",
  "frontend/src/components/dashboard/DailyOverviewTiles.tsx": "Shows a grid of daily task tiles summarizing completion status for prayers, fasting, tilawah, and other activities.",
  "frontend/src/components/dashboard/DailyProgressBar.tsx": "Renders a progress bar summarizing daily task completion percentage and counts, with loading and empty states.",
  "frontend/src/components/dashboard/DateSelector.tsx": "Provides a button-triggered popover calendar for selecting and updating the current date.",
  "frontend/src/components/dashboard/MonthlyProgressChart.tsx": "Draws an SVG line chart visualizing daily completion percentages for a given month.",
  "frontend/src/components/dashboard/PrayerTimesSection.tsx": "Displays prayer times with timezone selection, loading skeletons, and error handling for fetching times.",
  "frontend/src/components/dashboard/YesterdayProgressSummary.tsx": "Shows tilawah, tahfidz, and murojaah progress for the previous day with loading placeholders.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders the app footer with copyright info and a link to caffeine.ai.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the authenticated user's header with theme toggle, navigation menu, and logout handling.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout wrapper including header, routed content outlet, and footer.",
  "frontend/src/components/reports/DownloadCsvCard.tsx": "Lets users select a date range and export tasks as CSV or PDF by fetching data and generating a downloadable file.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Manages app theme state with system detection, persistence, and context access via useTheme.",
  "frontend/src/components/tracking/FastingModule.tsx": "Displays and updates fasting status and notes for a selected date using backend mutations.",
  "frontend/src/components/tracking/MurojaahModule.tsx": "Allows users to input and save Murojaah surah and verse ranges with validation and backend updates.",
  "frontend/src/components/tracking/SedekahModule.tsx": "Handles Sedekah completion tracking and opens a configured donation link while updating backend state.",
  "frontend/src/components/tracking/SholatModule.tsx": "Tracks daily prayer completion via toggles and syncs changes to the backend task record.",
  "frontend/src/components/tracking/TahfidzModule.tsx": "React component for viewing and updating daily Tahfidz tasks, including surah and verse range validation and saving via backend mutations.",
  "frontend/src/components/tracking/TilawahModule.tsx": "React component for editing and saving Tilawah tasks with surah and verse inputs, using backend queries and validation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook exposing identity state, login/logout, role checks, and admin status resolution using backend queries.",
  "frontend/src/hooks/useBackendQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, admin status, and daily task data through the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including loading, login flow, identity storage, and status flags.",
  "frontend/src/hooks/usePrayerTimes.ts": "Hook that calculates daily prayer times based on a selected timezone, with local storage persistence and auto-refresh at midnight.",
  "frontend/src/index.css": "Tailwind-based global styling with light/dark theme variables and utility definitions for the app’s visual design.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/admin/AdminGatePage.tsx": "Protects admin routes by verifying authentication and admin status, handling loading, errors, redirects, and access denial.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Admin dashboard with tabbed sections for user management, daily content, statistics, and application settings.",
  "frontend/src/pages/admin/DailyContentTab.tsx": "CRUD interface for daily Quran reflection, hadith, and motivational content, with form editing and previews.",
  "frontend/src/pages/admin/SettingsTab.tsx": "Allows admins to view and update the global sedekah payment link with validation and save feedback.",
  "frontend/src/pages/admin/StatisticsTab.tsx": "Renders admin statistics UI with date inputs and placeholder participation metrics, showing total users and progress bars.",
  "frontend/src/pages/admin/UserManagementTab.tsx": "Provides admin UI for listing users and creating new accounts via dialog, using backend hooks and principal validation.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing greeting, date selector, daily content, prayer times, progress, and worship tracking modules, with a profile setup dialog for new users.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using useAuth to trigger authentication and redirect users to either a saved return path or the dashboard.",
  "frontend/src/pages/MonthlyProgressPage.tsx": "Displays monthly task progress with navigation between months, charts, statistics, and CSV download support based on task data.",
  "frontend/src/utils/csv.ts": "Generates a CSV export from task data by mapping fields and escaping values.",
  "frontend/src/utils/date.ts": "Utility functions for timestamp conversion, formatting dates, and navigating days.",
  "frontend/src/utils/month.ts": "Provides helpers for month boundaries, labels, day counts, and list of days.",
  "frontend/src/utils/pdf.ts": "Builds a simple text-based PDF blob summarizing task details for a date range.",
  "frontend/src/utils/prayerTimes.ts": "Calculates Indonesian prayer times using solar position formulas and timezone presets.",
  "frontend/src/utils/progress.ts": "Computes task completion percentage and counts based on six worship-related criteria.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL hash.",
  "frontend/src/utils/validation.ts": "Validates surah and verse range inputs, ensuring required fields and correct numeric ordering.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and importing typography, container queries, and animation plugins.",
  "project_state.json": "Describes the project's current state, architecture, known issues, and implemented features for the Ramadhan Tracker app."
}