{
  "kind": "build_request",
  "title": "Fix prayer time accuracy, standardize affected UI to Indonesian, improve daily progress UI, and move report download to Monthly Progress page",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-53",
      "text": "Fix the prayer times calculation so displayed times are realistic and match the selected Indonesia timezone (WIB/WITA/WIT), avoiding negative/invalid values and ensuring times fall within 00:00–23:59 for the selected date.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "perbaiki jamnya karena belum sesuai dengan jadwal sholat"
        ]
      },
      "acceptanceCriteria": [
        "On the Dashboard, the Prayer Times section never renders negative times (e.g., \"-15:12\") or invalid formats.",
        "For each timezone option (WIB/WITA/WIT), Fajr < Sunrise < Dhuhr < Asr < Maghrib < Isha for the same selected date.",
        "Switching the timezone updates the displayed prayer times immediately and persists the selection across reloads (localStorage).",
        "Prayer times update correctly when the calendar date rolls over (auto-refresh behavior still works)."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Standardize the user-facing language to Bahasa Indonesia for the UI areas affected by this change set: Dashboard header copy, Prayer Times section labels/states, daily overview tiles, yesterday progress summary, and the report download UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "ubah ke bahasa indonesia saja"
        ]
      },
      "acceptanceCriteria": [
        "DashboardPage no longer shows English strings like “Welcome”, “Track your daily worship activities”, “Complete Your Profile”, “Save Profile”, and related form placeholders; they are replaced with Bahasa Indonesia equivalents.",
        "PrayerTimesSection labels and states (title, field labels, loading/empty/error text, retry action) are in Bahasa Indonesia.",
        "DailyOverviewTiles titles and summaries are in Bahasa Indonesia (e.g., Prayer/Fasting/Completed/Not recorded/Not completed are localized).",
        "DownloadCsvCard labels/toasts/button states are in Bahasa Indonesia (including validation errors and success/failure toasts).",
        "No new English strings are introduced in the modified components (unless they are non-user-facing logs)."
      ]
    },
    {
      "id": "REQ-55",
      "text": "Improve the Daily Progress (Progres Harian) component UI and behavior so it is visually consistent, handles loading/empty states, and uses the same completion rules as the shared progress utility.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "perbaiki tampilan progres hariannya juga"
        ]
      },
      "acceptanceCriteria": [
        "DailyProgressBar shows a clear loading skeleton or loading state while the task query is in-flight, instead of implicitly showing 0 progress.",
        "DailyProgressBar uses the shared progress calculation helper (frontend/src/utils/progress.ts) so its percentage/count logic is consistent with other progress views.",
        "If there is no task data for the selected date, the component shows an explicit empty state message in Bahasa Indonesia and does not misleadingly imply recorded completion.",
        "The progress bar and accompanying label are visually aligned and responsive (no overflow/truncation issues on mobile widths)."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Move the progress report download feature so it is available only on the Monthly Progress page, and remove it from the main Dashboard page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "fitur download pindahkan ke dashboard (progress bulanan) saja"
        ]
      },
      "acceptanceCriteria": [
        "DashboardPage no longer renders the DownloadCsvCard (or any report download UI).",
        "MonthlyProgressPage renders the report download UI (CSV/PDF) in a sensible location within the page layout.",
        "The download functionality continues to work (CSV and PDF export from backend task range), with Bahasa Indonesia labels/toasts.",
        "There is only one place in the authenticated UI where the report download UI is accessible: the Monthly Progress page."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not modify any files listed as immutable in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Backend must remain single-actor (no additional backend services).",
    "Use English only for this build request document; implement Bahasa Indonesia for user-facing UI per requirements."
  ],
  "nonGoals": [
    "Changing the backend schema or task data model for prayer times.",
    "Adding location/GPS-based prayer time calculations (keep using the existing WIB/WITA/WIT selection model).",
    "Adding new export formats beyond CSV and PDF.",
    "Redesigning the entire application theme outside of the affected components/pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}