{
  "kind": "build_request",
  "title": "Fix admin role bootstrap so the user can access /admin on production",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Fix the backend admin-bootstrap detection so `promoteToAdmin` correctly determines whether any Admin already exists, even when there are no `userTasks` entries yet (preventing permanent lockout where no one can become Admin).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "akses adminya masih belum saya dapat"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh deployment with no users/tasks created, calling `promoteToAdmin(<principal>)` successfully grants the Admin role to the target principal.",
        "On a deployment where an Admin role already exists, `promoteToAdmin` rejects non-admin callers with an English error message.",
        "The check for \"any admin exists\" does not rely on `userTasks.keys()` as the only source of truth (so it works even when no tasks exist yet)."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Add a backend query API that allows the frontend to safely determine whether the canister is in \"bootstrap mode\" (i.e., no Admin exists yet), so the UI can offer a first-admin recovery action only when appropriate.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "akses adminya masih belum saya dapat"
        ]
      },
      "acceptanceCriteria": [
        "A new query method is available that returns whether any Admin exists (or equivalently whether bootstrap mode is enabled).",
        "The method is callable by authenticated users and does not expose sensitive data beyond the boolean/bootstrap status.",
        "The returned value is consistent with the backend logic used by `promoteToAdmin`."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Update the Admin access-denied screen to include an English \"Bootstrap Admin Access\" action that is shown only when the backend reports bootstrap mode, and when clicked attempts to call `promoteToAdmin` for the currently logged-in principal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "akses adminya masih belum saya dapat"
        ]
      },
      "acceptanceCriteria": [
        "When bootstrap mode is true, the access-denied screen shows a button labeled in English (e.g., \"Bootstrap Admin Access\").",
        "Clicking the button calls the existing promote mutation with the current principal and shows a success toast in English on success.",
        "After success, the app re-checks admin status (React Query invalidation/refetch) and allows navigation to /admin without requiring manual cache clearing.",
        "When bootstrap mode is false, the bootstrap button is not displayed."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Improve the /admin gate error handling so that if role/admin checks fail (e.g., backend trap/network error), the page shows a clear English error state and a retry action rather than only generic messaging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "akses adminya masih belum saya dapat"
        ]
      },
      "acceptanceCriteria": [
        "If the admin-role check query errors, /admin shows an English error message that indicates the admin status could not be verified.",
        "The error UI provides an English \"Retry\" action that re-triggers the relevant role/admin queries.",
        "The existing loading state remains unchanged and continues to prevent false denials while checks are in progress."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional services).",
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Use English for any new or modified user-facing text touched by this change (toasts, buttons, error states)."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers beyond Internet Identity.",
    "Adding new admin features unrelated to restoring admin access (e.g., new admin tabs or new data models).",
    "Changing the existing dashboard feature set or tracking modules."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}