{
  "kind": "build_request",
  "title": "Fix daily progress persistence on app exit and switch statistics visualization to line chart",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Fix daily tracking persistence so that after a user records any daily progress (sholat, fasting, tilawah, murojaah, tahfidz, sedekah) and then closes/exits the web app (tab close, refresh, reopen), the previously saved values are reliably loaded from the backend for the same selected date (no need to re-mark from scratch).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "progres harian ketika habis  keluar dari web app datanya tidak tersimpan, harus mengulang menandai dari  awal lagi"
        ]
      },
      "acceptanceCriteria": [
        "Given a user updates any module and sees a success confirmation, when the user refreshes the page or closes and reopens the app, the same date’s data is fetched and rendered with the saved values.",
        "Updates that are in-flight when the user leaves the page do not silently get lost: the UI either completes the save reliably or informs the user that saving is still in progress / failed (so they can retry).",
        "No module overwrites other modules’ already-saved fields for the same date (partial updates must preserve existing fields).",
        "No runtime errors occur when saving on a date that previously had no Task record."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Replace the monthly progress “bar” visualization with a line chart (SVG-based) so the monthly progress page shows a line-only chart for daily percentage progress instead of vertical bars.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "dashboard statitistik nya jangan pakai balok tapi pakai chart garis saja"
        ]
      },
      "acceptanceCriteria": [
        "The monthly progress chart renders as a line chart (polyline/path) over the days of the selected month; no bar rectangles are rendered.",
        "The chart still shows Y-axis percentage labels (0–100%) and day labels along the X-axis (or a readable subset if space is limited).",
        "The chart remains horizontally scrollable for long months on mobile, consistent with the current UX.",
        "Empty state behavior remains correct: when there is no data, the chart area does not render and the existing empty state is shown."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Update any affected loading/error/empty UI states introduced or modified by these changes to use English user-facing text in the modified components/pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "Any new or modified user-facing strings in the touched UI (e.g., save-in-progress / save-failed messaging related to persistence, and any chart-related labels if changed) are in English.",
        "Existing strings that are not touched remain unchanged."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a real state migration is required.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*."
  ],
  "nonGoals": [
    "Do not add new tracking categories beyond the existing modules (sholat, fasting, tilawah, murojaah, tahfidz, sedekah).",
    "Do not redesign the entire dashboard UI; only change the requested chart type and the persistence bug.",
    "Do not introduce external databases, third-party auth providers, or real-time/websocket features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}