{
  "kind": "build_request",
  "title": "Fix Indonesia prayer times (WIB/WITA/WIT) to match real schedules",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-75",
      "text": "Fix the prayer time calculation so that the displayed schedule matches real Indonesian prayer schedules for the selected timezone (WIB/WITA/WIT) and selected date, eliminating clearly incorrect outputs (e.g., Subuh appearing around 09:12 or Isya around 00:03 for WIB). Update the implementation in `frontend/src/utils/prayerTimes.ts` accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "perbaiki jadwal sholat mengikuti jadwal yang berlaku di indonesia (wib, wita, dan wit). kerjakan sekarang"
        ]
      },
      "acceptanceCriteria": [
        "For each timezone option (WIB/WITA/WIT), the computed times are valid HH:MM and remain within 00:00–23:59 for the selected date.",
        "Times are strictly chronological: Subuh < Terbit < Dzuhur < Ashar < Maghrib < Isya.",
        "Timezone selection produces sensible shifts (WITA ~ +1 hour vs WIB, WIT ~ +2 hours vs WIB) for the same selected date, without wrapping into the wrong day.",
        "The Prayer Times card no longer shows obviously incorrect times like Subuh near mid-morning or Isya near midnight for WIB on typical dates."
      ]
    },
    {
      "id": "REQ-76",
      "text": "Ensure the Prayer Times UI reliably surfaces a user-visible error state (with a Retry action) when prayer time computation fails validation, and does not render an obviously-wrong schedule. Keep any newly introduced or modified user-facing text in the affected components in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "perbaiki jadwal sholat mengikuti jadwal yang berlaku di indonesia (wib, wita, dan wit). kerjakan sekarang"
        ]
      },
      "acceptanceCriteria": [
        "If computed prayer times fail validation (invalid format, out-of-range, or non-chronological), `frontend/src/components/dashboard/PrayerTimesSection.tsx` shows an error state with a working Retry button instead of displaying the times.",
        "Retry recomputes and, if the next computation succeeds, the card returns to the normal schedule display without a hard refresh.",
        "Any new or modified error/empty/retry text introduced while implementing this change is in English."
      ]
    }
  ],
  "constraints": [
    "Frontend code must not modify files under `frontend/src/components/ui` (compose them only).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`)."
  ],
  "nonGoals": [
    "Implementing location/GPS-based prayer times by user coordinates.",
    "Calling external prayer time APIs or integrating third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}