{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore admin bootstrap access and improve /admin gate UX",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Show a conditional 'Bootstrap Admin Access' action on the admin access-denied screen and call promoteToAdmin for the current principal when bootstrap mode is enabled.",
      "acceptanceCriteria": [
        "When bootstrap mode is true, the access-denied screen shows a button labeled in English (e.g., \"Bootstrap Admin Access\").",
        "Clicking the button calls the existing promote mutation with the current principal and shows a success toast in English on success.",
        "After success, the app re-checks admin status (React Query invalidation/refetch) and allows navigation to /admin without requiring manual cache clearing.",
        "When bootstrap mode is false, the bootstrap button is not displayed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook (e.g., useIsAdminBootstrapAvailable) that calls the backend capability isAdminBootstrapAvailable() and caches it under a stable query key; update the existing usePromoteToAdmin() onSuccess to also invalidate the bootstrap availability query key so the UI can immediately reflect that bootstrap mode is no longer available. Use the authorization component’s RBAC expectations (admin bootstrap + role checks) as the conceptual basis for when this UI should appear; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AdminAccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Update the access-denied UI to (1) query bootstrap mode via the new hook and (2) render an English-only \"Bootstrap Admin Access\" button only when bootstrap mode is true; on click, call the existing promoteToAdmin mutation with the currently logged-in principal (from Internet Identity), show an English success toast on success, and rely on React Query invalidation/refetch to transition the /admin route from denied to allowed without manual cache clearing. Keep existing copy-to-clipboard behavior, but ensure any modified/new user-facing text is English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Improve /admin gate error handling to show a clear English error state with a retry action when role/admin checks fail.",
      "acceptanceCriteria": [
        "If the admin-role check query errors, /admin shows an English error message that indicates the admin status could not be verified.",
        "The error UI provides an English \"Retry\" action that re-triggers the relevant role/admin queries.",
        "The existing loading state remains unchanged and continues to prevent false denials while checks are in progress."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "modify",
          "description": "Extend useAuth() to surface error state and retry/refetch controls for the underlying role/admin checks (e.g., expose adminCheckError/roleCheckError and a retry function that triggers refetch on the relevant queries), without changing the existing isLoading semantics (loading should still block denial while checks are in progress). Align with the authorization component’s RBAC query patterns and error-handling guidance; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminGatePage.tsx",
          "operation": "modify",
          "description": "Update the /admin gate to render a dedicated English error state when role/admin checks error (network/trap/other query error), including an English \"Retry\" action wired to the retry/refetch controls exposed by useAuth(). Preserve the current loading UI and behavior so users are not denied while checks are in flight. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}