{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Prayer time accuracy fixes, Indonesian UI localization, daily progress UX improvements, and report download relocation",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Fix prayer time calculations to be realistic per selected Indonesia timezone and never display invalid/negative times; ensure timezone persistence and correct auto-refresh behavior.",
      "acceptanceCriteria": [
        "On the Dashboard, the Prayer Times section never renders negative times (e.g., \"-15:12\") or invalid formats.",
        "For each timezone option (WIB/WITA/WIT), Fajr < Sunrise < Dhuhr < Asr < Maghrib < Isha for the same selected date.",
        "Switching the timezone updates the displayed prayer times immediately and persists the selection across reloads (localStorage).",
        "Prayer times update correctly when the calendar date rolls over (auto-refresh behavior still works)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/prayerTimes.ts",
          "operation": "modify",
          "description": "Correct the prayer time math to avoid invalid outputs (e.g., negative hours), normalize intermediate solar calculations, and robustly normalize final times to 00:00–23:59 for the selected date/timezone while preserving the expected ordering Fajr→Isha."
        },
        {
          "path": "frontend/src/hooks/usePrayerTimes.ts",
          "operation": "modify",
          "description": "Fix retry/auto-refresh behavior so recalculation actually re-runs (e.g., via a refresh key), keep timezone selection persisted in localStorage, and ensure recalculation triggers immediately on timezone change and at midnight rollover."
        },
        {
          "path": "frontend/src/components/dashboard/PrayerTimesSection.tsx",
          "operation": "modify",
          "description": "Add defensive rendering for calculated times (only render valid HH:mm strings), and ensure the UI never displays invalid/negative values even if calculation fails; keep existing loading/error handling."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Standardize affected user-facing UI strings to Bahasa Indonesia (Dashboard header, Prayer Times, daily tiles, yesterday summary, and report download UI).",
      "acceptanceCriteria": [
        "DashboardPage no longer shows English strings like “Welcome”, “Track your daily worship activities”, “Complete Your Profile”, “Save Profile”, and related form placeholders; they are replaced with Bahasa Indonesia equivalents.",
        "PrayerTimesSection labels and states (title, field labels, loading/empty/error text, retry action) are in Bahasa Indonesia.",
        "DailyOverviewTiles titles and summaries are in Bahasa Indonesia (e.g., Prayer/Fasting/Completed/Not recorded/Not completed are localized).",
        "DownloadCsvCard labels/toasts/button states are in Bahasa Indonesia (including validation errors and success/failure toasts).",
        "No new English strings are introduced in the modified components (unless they are non-user-facing logs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Replace English dashboard header copy and profile setup dialog strings/placeholders/buttons with Bahasa Indonesia equivalents, keeping existing auth/profile logic intact."
        },
        {
          "path": "frontend/src/components/dashboard/PrayerTimesSection.tsx",
          "operation": "modify",
          "description": "Localize the Prayer Times section title, labels, and error/retry/empty states into Bahasa Indonesia while keeping the existing shadcn/ui composition (do not modify files under frontend/src/components/ui)."
        },
        {
          "path": "frontend/src/components/dashboard/DailyOverviewTiles.tsx",
          "operation": "modify",
          "description": "Localize tile titles and summary strings into Bahasa Indonesia (including prayer/wajib/sunnah wording and completed/not completed/not recorded states), without changing the underlying task-fetching behavior."
        },
        {
          "path": "frontend/src/components/dashboard/YesterdayProgressSummary.tsx",
          "operation": "modify",
          "description": "Localize the 'Yesterday' summary header and 'Not recorded' fallback text into Bahasa Indonesia."
        },
        {
          "path": "frontend/src/components/reports/DownloadCsvCard.tsx",
          "operation": "modify",
          "description": "Localize the report download card title, field labels, validation errors, button states, and success/failure toasts into Bahasa Indonesia, keeping CSV/PDF generation behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Improve Daily Progress (Progres Harian) UI/behavior with explicit loading and empty states, and align completion logic with the shared progress utility.",
      "acceptanceCriteria": [
        "DailyProgressBar shows a clear loading skeleton or loading state while the task query is in-flight, instead of implicitly showing 0 progress.",
        "DailyProgressBar uses the shared progress calculation helper (frontend/src/utils/progress.ts) so its percentage/count logic is consistent with other progress views.",
        "If there is no task data for the selected date, the component shows an explicit empty state message in Bahasa Indonesia and does not misleadingly imply recorded completion.",
        "The progress bar and accompanying label are visually aligned and responsive (no overflow/truncation issues on mobile widths)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/progress.ts",
          "operation": "modify",
          "description": "Extend the shared progress utility to support DailyProgressBar needs (e.g., expose consistent percentage and/or completed/total counts) while preserving existing behavior for MonthlyProgressPage usage."
        },
        {
          "path": "frontend/src/components/dashboard/DailyProgressBar.tsx",
          "operation": "modify",
          "description": "Update DailyProgressBar to (1) use the shared progress helper from frontend/src/utils/progress.ts, (2) render a clear loading skeleton/state while fetching, (3) show an explicit Bahasa Indonesia empty state when no task exists for the selected date, and (4) ensure responsive alignment of the bar and label on mobile."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Move progress report download UI from Dashboard to Monthly Progress page and ensure it remains functional and uniquely accessible there.",
      "acceptanceCriteria": [
        "DashboardPage no longer renders the DownloadCsvCard (or any report download UI).",
        "MonthlyProgressPage renders the report download UI (CSV/PDF) in a sensible location within the page layout.",
        "The download functionality continues to work (CSV and PDF export from backend task range), with Bahasa Indonesia labels/toasts.",
        "There is only one place in the authenticated UI where the report download UI is accessible: the Monthly Progress page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Remove DownloadCsvCard import and rendering from the Dashboard layout so no report download UI is shown on the Dashboard."
        },
        {
          "path": "frontend/src/pages/MonthlyProgressPage.tsx",
          "operation": "modify",
          "description": "Add DownloadCsvCard to the Monthly Progress page in a sensible position within the existing layout (e.g., near monthly stats/chart), ensuring the page remains responsive."
        },
        {
          "path": "frontend/src/components/reports/DownloadCsvCard.tsx",
          "operation": "modify",
          "description": "Ensure the component remains reusable on MonthlyProgressPage and continues to download CSV/PDF correctly; keep Bahasa Indonesia labels/toasts consistent with REQ-54."
        }
      ]
    }
  ]
}