{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Indonesian prayer times for WIB/WITA/WIT with validation-safe UI error handling",
  "requirements": [
    {
      "id": "REQ-75",
      "summary": "Correct WIB/WITA/WIT prayer time calculation to match real Indonesian schedules for the selected date and avoid wrong-day wrapping.",
      "acceptanceCriteria": [
        "For each timezone option (WIB/WITA/WIT), the computed times are valid HH:MM and remain within 00:00–23:59 for the selected date.",
        "Times are strictly chronological: Subuh < Terbit < Dzuhur < Ashar < Maghrib < Isya.",
        "Timezone selection produces sensible shifts (WITA ~ +1 hour vs WIB, WIT ~ +2 hours vs WIB) for the same selected date, without wrapping into the wrong day.",
        "The Prayer Times card no longer shows obviously incorrect times like Subuh near mid-morning or Isya near midnight for WIB on typical dates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/prayerTimes.ts",
          "operation": "modify",
          "description": "Fix the core solar-noon/prayer time computation by correctly applying the selected timezone offset (GMT+7/+8/+9) and longitude correction to produce realistic same-day local clock times; update time formatting to avoid modulo-24 wrapping (treat out-of-day results as invalid) so WIB/WITA/WIT do not silently shift into the wrong day; adjust validation to enforce: valid HH:MM, within 00:00–23:59, and strict chronological ordering without over-restrictive hardcoded city-specific ranges that can falsely fail across Indonesia."
        },
        {
          "path": "frontend/src/hooks/usePrayerTimes.ts",
          "operation": "modify",
          "description": "Align hook behavior with the corrected calculator/validator: ensure any invalid or out-of-day results become a validation failure (no schedule rendered), keep the error message in English, and maintain stable recomputation when date or timezone changes."
        }
      ]
    },
    {
      "id": "REQ-76",
      "summary": "Ensure Prayer Times UI shows a robust English error state with Retry when computed times fail validation, and never renders an obviously-wrong schedule.",
      "acceptanceCriteria": [
        "If computed prayer times fail validation (invalid format, out-of-range, or non-chronological), `frontend/src/components/dashboard/PrayerTimesSection.tsx` shows an error state with a working Retry button instead of displaying the times.",
        "Retry recomputes and, if the next computation succeeds, the card returns to the normal schedule display without a hard refresh.",
        "Any new or modified error/empty/retry text introduced while implementing this change is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/dashboard/PrayerTimesSection.tsx",
          "operation": "modify",
          "description": "Make the error-state rendering fully authoritative whenever the hook reports computation/validation failure, including a reliable Retry action that re-triggers computation; ensure any newly introduced or modified user-facing strings in the error/retry flow are in English and prevent fallback rendering of a potentially wrong schedule."
        },
        {
          "path": "frontend/src/hooks/usePrayerTimes.ts",
          "operation": "modify",
          "description": "Harden the Retry flow to guarantee it clears any previously computed times, re-runs validation, and only returns to normal UI when a valid schedule is produced (no hard refresh), keeping any new/modified error strings in English."
        }
      ]
    }
  ]
}